## Performing Aggregations

Let us understand how to aggregate the data.

* We can perform global aggregations as well as aggregations by key.

* Global Aggregations
  * Get total number of orders.
  * Get revenue for a given order id.
  * Get number of records with order_status either COMPLETED or CLOSED.

* Aggregations by key - using `GROUP BY`
  * Get number of orders by date or status.
  * Get revenue for each order_id.
  * Get daily product revenue (using order date and product id as keys).

* We can also use `HAVING` clause to apply filtering on top of aggregated data.
  * Get daily product revenue where revenue is greater than $500 (using order date and product id as keys).

* Rules while using `GROUP BY`.
  * We can have the columns which are specified as part of `GROUP BY` in `SELECT` clause.
  * On top of those, we can have derived columns using aggregate functions.
  * We cannot have any other columns that are not used as part of `GROUP BY` or derived column using non aggregate functions.
  * We will not be able to use aggregate functions or aliases used in the select clause as part of the where clause.
  * If we want to filter based on aggregated results, then we can leverage `HAVING` on top of `GROUP BY` (specifying `WHERE` is not an option)

* Typical query execution - `FROM` -> `WHERE` -> `GROUP BY` -> `HAVING` -> `SELECT` -> `ORDER BY`

In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://suryakantkumar:None@localhost:5432/suryakantkumar

env: DATABASE_URL=postgresql://suryakantkumar:None@localhost:5432/suryakantkumar

* Get Count of All orders

In [3]:
%%sql

SELECT
    COUNT(order_id)
FROM
    orders

1 rows affected.

[(68883,)]

* get Count of All Order dates

In [4]:
%%sql

SELECT
    COUNT(DISTINCT order_date)
FROM
    orders

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
1 rows affected.

[(364,)]

* Get all Item details Where Order Id is 2

In [5]:
%%sql

SELECT 
    *
FROM 
    order_items 
WHERE 
    order_item_order_id = 2

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
3 rows affected.

[(2, 2, 1073, 1, 199.99, 199.99),
 (3, 2, 502, 5, 250.0, 50.0),
 (4, 2, 403, 1, 129.99, 129.99)]

* Get Revenue from Single Order having Order Id is 2

In [6]:
%%sql

SELECT 
    ROUND(SUM(order_item_subtotal::numeric), 2) AS order_revenue
FROM 
    order_items 
WHERE 
    order_item_order_id = 2

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
1 rows affected.

[(Decimal('579.98'),)]

* get Count of Completed Orders

In [7]:
%%sql

SELECT 
    COUNT(1)
FROM 
    orders
WHERE 
    order_status IN ('COMPLETE', 'CLOSED')

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
1 rows affected.

[(30455,)]

* Get Count of Orders Per day

In [8]:
%%sql

SELECT 
    order_date,
    COUNT(1)
FROM 
    orders
GROUP BY 
    order_date
ORDER BY 
    order_date
LIMIT 
    10

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 143),
 (datetime.datetime(2013, 7, 26, 0, 0), 269),
 (datetime.datetime(2013, 7, 27, 0, 0), 202),
 (datetime.datetime(2013, 7, 28, 0, 0), 187),
 (datetime.datetime(2013, 7, 29, 0, 0), 253),
 (datetime.datetime(2013, 7, 30, 0, 0), 227),
 (datetime.datetime(2013, 7, 31, 0, 0), 252),
 (datetime.datetime(2013, 8, 1, 0, 0), 246),
 (datetime.datetime(2013, 8, 2, 0, 0), 224),
 (datetime.datetime(2013, 8, 3, 0, 0), 183)]

* Get Count of orders as per Status of Order

In [9]:
%%sql

SELECT 
    order_status,
    COUNT(1) AS status_count
FROM 
    orders
GROUP 
    BY order_status
ORDER 
    BY status_count DESC
LIMIT
    10

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
9 rows affected.

[('COMPLETE', 22899),
 ('PENDING_PAYMENT', 15030),
 ('PROCESSING', 8275),
 ('PENDING', 7610),
 ('CLOSED', 7556),
 ('ON_HOLD', 3798),
 ('SUSPECTED_FRAUD', 1558),
 ('CANCELED', 1428),
 ('PAYMENT_REVIEW', 729)]

* Get Revenue Per Order

In [10]:
%%sql

SELECT 
    order_item_order_id,
    SUM(order_item_subtotal) AS order_revenue
FROM 
    order_items
GROUP BY 
    order_item_order_id
LIMIT 
    10

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
10 rows affected.

[(1, 299.98),
 (2, 579.98),
 (4, 699.85),
 (5, 1129.8600000000001),
 (7, 579.9200000000001),
 (8, 729.8399999999999),
 (9, 599.96),
 (10, 651.9200000000001),
 (11, 919.79),
 (12, 1299.8700000000001)]

* This query using `round` will fail as `sum(order_item_subtotal)` will not return the data accepted by `round`.

In [11]:
%%sql

SELECT 
    order_item_order_id,
    ROUND(SUM(order_item_subtotal), 2) AS order_revenue
FROM 
    order_items
GROUP BY 
    order_item_order_id 
LIMIT 
    10

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
(psycopg2.errors.UndefinedFunction) function round(double precision, integer) does not exist
LINE 3:     ROUND(SUM(order_item_subtotal), 2) AS order_revenue
            ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.

[SQL: SELECT
    order_item_order_id,
    ROUND(SUM(order_item_subtotal), 2) AS order_revenue
FROM
    order_items
GROUP BY
    order_item_order_id
LIMIT
    10]
(Background on this error at: https://sqlalche.me/e/14/f405)

* We have to convert the data type of `order_item_subtotal` to `numeric`.

In [12]:
%%sql

SELECT 
    order_item_order_id,
    ROUND(SUM(order_item_subtotal::numeric), 2) AS order_revenue
FROM 
    order_items
GROUP BY 
    order_item_order_id
LIMIT 
    10

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
10 rows affected.

[(1, Decimal('299.98')),
 (2, Decimal('579.98')),
 (4, Decimal('699.85')),
 (5, Decimal('1129.86')),
 (7, Decimal('579.92')),
 (8, Decimal('729.84')),
 (9, Decimal('599.96')),
 (10, Decimal('651.92')),
 (11, Decimal('919.79')),
 (12, Decimal('1299.87'))]

* Get the Revenue Generated per product per day

In [13]:
%%sql

SELECT 
    o.order_date,
    oi.order_item_product_id,
    round(sum(oi.order_item_subtotal::numeric), 2) AS revenue
FROM 
    orders o 
    JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE 
    o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY 
    o.order_date,
    oi.order_item_product_id
LIMIT 
    10

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 24, Decimal('319.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 93, Decimal('74.97')),
 (datetime.datetime(2013, 7, 25, 0, 0), 134, Decimal('100.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49')),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99')),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44')),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('1949.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('1650.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 572, Decimal('119.97')),
 (datetime.datetime(2013, 7, 25, 0, 0), 625, Decimal('199.99'))]

* We cannot use the aliases in select clause in `WHERE`. In this case **revenue** cannot be used in `WHERE` clause.

In [14]:
%%sql

SELECT 
    o.order_date,
    oi.order_item_product_id,
    ROUND(SUM(oi.order_item_subtotal::numeric), 2) AS revenue
FROM 
    orders o 
    JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE 
    o.order_status IN ('COMPLETE', 'CLOSED')
    AND 
    revenue >= 500
GROUP BY 
    o.order_date,
    oi.order_item_product_id
LIMIT 
    10

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
(psycopg2.errors.UndefinedColumn) column "revenue" does not exist
LINE 13:     revenue >= 500
             ^

[SQL: SELECT
    o.order_date,
    oi.order_item_product_id,
    ROUND(SUM(oi.order_item_subtotal::numeric), 2) AS revenue
FROM
    orders o
    JOIN
    order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE
    o.order_status IN ('COMPLETE', 'CLOSED')
    AND
    revenue >= 500
GROUP BY
    o.order_date,
    oi.order_item_product_id
LIMIT
    10]
(Background on this error at: https://sqlalche.me/e/14/f405)

* We cannot use aggregate functions in `WHERE` clause.

In [15]:
%%sql

SELECT 
    o.order_date,
    oi.order_item_product_id,
    ROUND(SUM(oi.order_item_subtotal::numeric), 2) AS revenue
FROM 
    orders o 
    JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE 
    o.order_status IN ('COMPLETE', 'CLOSED')
    AND 
    ROUND(SUM(oi.order_item_subtotal::numeric), 2) >= 500
GROUP BY 
    o.order_date,
    oi.order_item_product_id
LIMIT 
    10

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
(psycopg2.errors.GroupingError) aggregate functions are not allowed in WHERE
LINE 13:     ROUND(SUM(oi.order_item_subtotal::numeric), 2) >= 500
                   ^

[SQL: SELECT
    o.order_date,
    oi.order_item_product_id,
    ROUND(SUM(oi.order_item_subtotal::numeric), 2) AS revenue
FROM
    orders o
    JOIN
    order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE
    o.order_status IN ('COMPLETE', 'CLOSED')
    AND
    ROUND(SUM(oi.order_item_subtotal::numeric), 2) >= 500
GROUP BY
    o.order_date,
    oi.order_item_product_id
LIMIT
    10]
(Background on this error at: https://sqlalche.me/e/14/f405)

* Get Revenue for each product per day having revenue >= 500

In [16]:
%%sql

SELECT 
    o.order_date,
    oi.order_item_product_id,
    ROUND(SUM(oi.order_item_subtotal::numeric), 2) AS revenue
FROM 
    orders o 
    JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE 
    o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY 
    o.order_date, 
    oi.order_item_product_id
HAVING 
    ROUND(SUM(oi.order_item_subtotal::numeric), 2) >= 500
ORDER BY 
    o.order_date, revenue DESC
LIMIT 
    10

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49')),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('4499.70')),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('2999.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1014, Decimal('2798.88')),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('1949.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('1650.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 627, Decimal('1079.73')),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99'))]

* Get Count of Products having revenue from it is >= 500

In [17]:
%%sql

SELECT 
    COUNT(1) 
FROM (
    SELECT 
        o.order_date,
        oi.order_item_product_id,
        ROUND(SUM(oi.order_item_subtotal::numeric), 2) AS revenue
    FROM 
        orders o 
        JOIN 
        order_items oi
            ON o.order_id = oi.order_item_order_id
    WHERE 
        o.order_status IN ('COMPLETE', 'CLOSED')
    GROUP BY 
        o.order_date, 
        oi.order_item_product_id
    HAVING 
        ROUND(SUM(oi.order_item_subtotal::numeric), 2) >= 500
) q

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
1 rows affected.

[(3339,)]